src/cf/Documents/ВходящееСообщение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВходящееСообщение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обменник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ВходящееСообщение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьВходящееСообщение(Тело, Обменник) Экспорт
	
	ВходящееСообщение = Документы.ВходящееСообщение.СоздатьДокумент();
	ВходящееСообщение.Тело = Тело;
	ВходящееСообщение.Обменник = Обменник;
	ВходящееСообщение.Дата = ТекущаяДатаСеанса();
	ВходящееСообщение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ВходящееСообщение.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
